import { HistoricEventsData } from '../../types/historic-events';

export const HISTORIC_EVENTS_DATA: HistoricEventsData = {
  science: {
    categoryTitle: 'Наука',
    historicEvents: [
      [
        { year: 1953, info: 'Открытие структуры ДНК Джеймсом Уотсоном и Фрэнсисом Криком.' },
        { year: 1957, info: 'Запуск первого искусственного спутника Земли, «Спутник-1», Советским Союзом.' },
      ],
      [
        { year: 1969, info: 'Аполлон 11: люди впервые высадились на Луну.' },
        { year: 1975, info: 'Запуск программы «Викинг», исследующей Марс.' },
        { year: 1983, info: 'Запуск программы по поиску экзопланет.' },
        { year: 1996, info: 'Объявление о наличии воды на Марсе.' },
      ],
      [
        { year: 2001, info: 'Запуск телескопа «Кеплер» для поиска экзопланет.' },
        { year: 2003, info: 'Успешное завершение миссии «Марс-Спирит» и «Марс-Оппортюнити».' },
        { year: 2010, info: 'Ученые создали первую синтетическую жизнь.' },
        { year: 2014, info: 'Ученые обнаружили возможные следы жизни на луне Европы.' },
      ],
      [
        { year: 2015, info: 'Первые фотографии черной дыры в центре нашей галактики.' },
        { year: 2016, info: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11.' },
        { year: 2017, info: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi.' },
        { year: 2018, info: 'Ученые выявили новые экзопланеты в обитаемой зоне своих звезд.' },
        { year: 2019, info: 'Открытие нового класса материалов с уникальными свойствами.' },
        { year: 2020, info: 'Создана первая полная модель человеческого мозга на суперкомпьютере.' },
        { year: 2021, info: 'Представлена первая вакцина против COVID-19, одобренная для массового использования.' },
        { year: 2022, info: 'Доказано, что млекопитающие могут дышать через кожу.' },
      ],
      [
        { year: 2023, info: 'Начало испытаний новых технологий редактирования генома.' },
        { year: 2024, info: 'Разработка новых методов лечения рака с помощью иммунотерапии.' },
      ],
    ],
  },
  literature: {
    categoryTitle: 'Литература',
    historicEvents: [
      [
        { year: 2011, info: 'Премьера романа Харуки Мураками «1Q84».' },
        { year: 2012, info: 'Выход сборника рассказов «Новая проза».' },
      ],
      [
        { year: 2013, info: 'Премьера пьесы «Сон в летнюю ночь» на Бродвее.' },
        { year: 2014, info: 'Выход романа «Завтра, в другое время».' },
        { year: 2015, info: 'Публикация биографии Дж. К. Роулинг.' },
      ],
      [
        { year: 2016, info: 'Выход нового романа Джоан Роулинг о Гарри Поттере.' },
        { year: 2017, info: 'Умер писатель и лауреат Нобелевской премии Тони Моррисон.' },
      ],
      [
        { year: 2018, info: 'Стартует конкурс на лучшую короткую прозу среди молодых авторов.' },
        { year: 2019, info: 'Выход книги «Общая теория относительности».' },
      ],
      [
        { year: 2020, info: 'Вышел новый роман Аланды Никсон о фэнтези мире.' },
        { year: 2021, info: 'Лауреатами Букеровской премии стали несколько авторов из Африки.' },
      ],
      [
        { year: 2022, info: 'Издание книги о важнейших событиях 2021 года.' },
        { year: 2023, info: 'Публикация антологии современных писателей.' },
      ],
    ],
  },
  cinema: {
    categoryTitle: 'Кино',
    historicEvents: [
      [
        { year: 2014, info: 'Выход фильма «Интерстеллар», ставшего культовым в научной фантастике.' },
        { year: 2016, info: 'Релиз фильма «Ла-Ла Ленд», который получил множество наград.' },
        { year: 2017, info: 'Награждение «Оскара» за лучший фильм «Лунный свет».' },
        { year: 2018, info: 'Премьера «Чёрной пантеры», ставшей культурным явлением.' },
      ],
      [
        { year: 2019, info: 'Выход фильма «Джокер», который вызвал много споров.' },
        { year: 2020, info: 'Запуск стриминговых платформ с новыми оригинальными фильмами.' },
        { year: 2021, info: 'Выход нового фильма из серии «Дюна», который получил признание критиков.' },
        { year: 2022, info: 'Премьера нового фильма Тарантино, который привлек внимание на Каннском фестивале.' },
        { year: 2023, info: 'Премьера «Аватара 2», ставшего самым кассовым фильмом года.' },
        { year: 2024, info: 'Планируется выход нового фильма Marvel.' },
        { year: 2025, info: 'Анонс новых технологий в киноиндустрии.' },
        { year: 2026, info: 'Ожидается завершение съемок нескольких долгожданных проектов.' },
      ],
    ],
  },
  sport: {
    categoryTitle: 'Спорт',
    historicEvents: [
      [
        { year: 2016, info: 'Рио-де-Жанейро принял летние Олимпийские игры.' },
        { year: 2018, info: 'Чемпионат мира по футболу проходит в России.' },
      ],
      [
        { year: 2020, info: 'Летние Олимпийские игры в Токио были перенесены на 2021 год из-за пандемии.' },
        { year: 2021, info: 'Токийские Олимпийские игры прошли с соблюдением строгих мер безопасности.' },
      ],
      [
        { year: 2022, info: 'Чемпионат мира по футболу проходит в Катаре.' },
        { year: 2023, info: 'Проведение Кубка мира по регби в Франции.' },
      ],
      [
        { year: 2024, info: 'Ожидаются летние Олимпийские игры в Париже.' },
        { year: 2025, info: 'Запланирован чемпионат мира по хоккею.' },
      ],
      [
        { year: 2026, info: 'Планируется расширение участия стран в Олимпийских играх.' },
        { year: 2027, info: 'Ожидается открытие новых спортивных объектов.' },
      ],
      [
        { year: 2028, info: 'Возможные изменения в правилах международных соревнований.' },
        { year: 2029, info: 'Новые рекорды в мировом спорте.' },
      ],
    ],
  },
  games: {
    categoryTitle: 'Игры',
    historicEvents: [
      [
        { year: 1998, info: 'Выход игры «Half-Life», которая оказала большое влияние на игровой рынок.' },
        { year: 2012, info: 'Выпуск «Counter-Strike: Global Offensive», ставшей одной из самых популярных игр.' },
      ],
      [
        { year: 2016, info: 'Выход «Overwatch», которая стала сенсацией в мире игр.' },
        { year: 2017, info: 'Запуск платформы для стриминга игр Twitch, которая продолжает расти.' },
      ],
      [
        { year: 2018, info: 'Премьера «God of War», получившей множество наград.' },
        { year: 2019, info: 'Выпуск «Sekiro: Shadows Die Twice», ставшей хитом среди игроков.' },
      ],
      [
        { year: 2020, info: 'Выход «The Last of Us Part II», ставшей одной из самых обсуждаемых игр года.' },
        { year: 2021, info: 'Запуск нового поколения игровых консолей.' },
      ],
      [
        { year: 2022, info: 'Выход «Elden Ring», ставшей культовой игрой.' },
        { year: 2023, info: 'Премьера «Starfield», ожидаемой игры от Bethesda.' },
      ],
      [
        { year: 2024, info: 'Анонс новых технологий в разработке игр.' },
        { year: 2025, info: 'Разработка игр с поддержкой виртуальной реальности.' },
      ],
    ],
  },
  technology: {
    categoryTitle: 'Технологии',
    historicEvents: [
      [
        { year: 1983, info: 'Появление первого мобильного телефона.' },
        { year: 1991, info: 'Запуск первого веб-сайта.' },
      ],
      [
        { year: 2001, info: 'Выпуск Windows XP, ставшей одной из самых популярных операционных систем.' },
        { year: 2007, info: 'Появление первого iPhone.' },
      ],
      [
        { year: 2010, info: 'Запуск Instagram, ставшего популярной социальной сетью.' },
        { year: 2015, info: 'Распространение технологий 4G.' },
        { year: 2016, info: 'Введение технологий искусственного интеллекта в повседневную жизнь.' },
        { year: 2019, info: 'Запуск первых беспилотных автомобилей.' },
      ],
      [
        { year: 2020, info: 'Появление технологий 5G в массовом использовании.' },
        { year: 2021, info: 'Распространение технологий дополненной реальности.' },
      ],
      [
        { year: 2022, info: 'Анонс новых технологий для умных домов.' },
        { year: 2023, info: 'Обсуждение этики использования ИИ.' },
      ],
    ],
  },
};

export const CATEGORIES = Object.keys(HISTORIC_EVENTS_DATA);
export const CATEGORIES_TOTAL_COUNT = CATEGORIES.length;
